#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main() 
{
	//char a = 127;
	//// 127 的二进制编码 0111 1111
	//char b = 3;
	//// 3 的二进制编码   0000 0011
	//char c = a + b;//把 a + b 的值赋给 c
	////char 类型不满足 int 类型的长度，整型提升得出
	//// 127 
	////0000 0000 0000 0000 0000 0000 0111 1111
	//// 3
	////0000 0000 0000 0000 0000 0000 0000 0011
	//// 故 a + b 的值为
	////0000 0000 0000 0000 0000 0000 1000 0010
	////这里以为 c 是 char 类型的变量，所以发生了截断 c，取低八位也就是 1000 0010
	////取完低八位后，截断之后的值是 1000 0010，注意这里的最高位是 1，也就是说它是一个负数
	////它服从补码的规则
	////1000 0010 ->补码
	////1000 0001 ->反码
	////0111 1110 ->原码	126
	////所以这个是有符号的	126
	////即 -126
	//printf("%d", c);

	char a = 3;//0000 0001
	char b = 3;//0000 0010
	int c = a && b;
	printf("%d\n", c);//个位
	if (a | b)
	{
		printf("i");//个位
	}
	else printf("o");
	return 0;
}